In [83]:
import pandas as pd

In [90]:
df = pd.read_csv('./historical.csv')
df.head()

          Item Month  Sales  Stock on Hand  Orders  Order Size
0  Lawn Chairs   Jan      5             50       0          20
1  Lawn Chairs   Feb      8             45       0          20
2  Lawn Chairs   Mar     12             37       0          20
3  Lawn Chairs   Apr     12             25       1          20
4  Lawn Chairs   May     23             33       1          20

In [92]:
grouped = df["Sales"].groupby(df['Item'])
grouped.mean()

Item
Coolers            38.583333
Crossbows          51.750000
Flippy Floppies    73.083333
Lawn Chairs        22.083333
Pool Noodles       64.666667
Umbrellas          48.333333
Waffle Irons       55.916667
Name: Sales, dtype: float64

In [93]:
grouped.std()

Item
Coolers            29.053112
Crossbows          31.241362
Flippy Floppies    14.228386
Lawn Chairs        16.800749
Pool Noodles       19.873845
Umbrellas          21.111536
Waffle Irons       28.192386
Name: Sales, dtype: float64

In [94]:
grouped.max()

Item
Coolers             78
Crossbows          142
Flippy Floppies     90
Lawn Chairs         50
Pool Noodles        98
Umbrellas           70
Waffle Irons       112
Name: Sales, dtype: int64

In [99]:
history.loc[history.groupby("Item")["Sales"].idxmax()]

               Item Month  Sales  Number per order
30          Coolers   Jul     78               NaN
47        Crossbows   Dec    142               NaN
74  Flippy Floppies   Mar     90               NaN
6       Lawn Chairs   Jul     50               NaN
62     Pool Noodles   Mar     98               NaN
15        Umbrellas   Apr     70               NaN
49     Waffle Irons   Feb    112               NaN